# #4)
#  შექმენით პროგრამა, სადაც მოახდენთ სიაზე მუშაობას. თქვენ გადმოგეცემათ ერთი სია,
#  დავალება კი შემდეგია: უნდა დაითვალოთ ლუწ ინდექსებზე მყოფი რიცხვების ჯამი, ასევე
# კენტ ინდექსებზე მყოფი რიცხვების ჯამი. საბოლოოდ ორივე დაამატოთ ახალ სიაში და დააბრუნოთ ეს
# სია. გამოიყენეთ შემდეგი სიები:

# [80]
# [100,50]
# [50,60,70,80]
# [13,27,49]
# [70,58,75,34,91]

# Test cases:

# [80] -> [80,0]
# [100,50] -> [100,50]
# [50,60,70,80] -> [120,140]
# [13,27,49] -> [62,27]
# [70,58,75,34,91] -> [236,92]


list [1,2,3,4,5,6,7,8,9]

list_2 =[]
        #aq ar vici ra gamoviyeno (0, len(list)) amis magivrad
for i in range(0, len(list)):
    if i %2 == 0:
        list.append(i)
        #aq ar vici ra gamoviyeno (0, len(list)) amis magivrad
for i in range(0, len(list)):
    if i %2 ==1:
        list.append(i)

print(list + list_2.append)        